; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v10)
             (pred_4 ?v9 ?v2)
             (pred_9 ?v11 ?v2)
             (pred_5 ?v12 ?v11 )
	     (pred_1 ?v11)
             (pred_8 ?v3)
             (pred_3 ?v9)
             (pred_7 ?v2)
             (pred_12 ?v11)
             (pred_11 ?v9)
             (pred_6 ?v11)
             (pred_10 ))



(:action op_3
:parameters (?v7 ?v6 ?v1 ?v4)
:precondition (and (pred_8 ?v7) (pred_8 ?v6) (pred_3 ?v1) (pred_7 ?v4)
          (pred_2 ?v7 ?v6) (pred_4 ?v1 ?v4)
                   (pred_9 ?v6 ?v4) (pred_1 ?v7) 
                   (pred_12 ?v6) (pred_11 ?v1))
:effect (and  (pred_6 ?v6) (not (pred_12 ?v6))))


(:action op_2
:parameters (?v7 ?v5)
:precondition (and (pred_8 ?v7) (pred_8 ?v5)
               (pred_1 ?v7) (pred_2 ?v7 ?v5) (pred_6 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v7))))

(:action op_1
:parameters (?v7 ?v1)
:precondition (and (pred_8 ?v7) (pred_3 ?v1) 
                  (pred_1 ?v7) (pred_5 ?v1 ?v7) (pred_10 ))
:effect (and (pred_11 ?v1)
   (not (pred_5 ?v1 ?v7)) (not (pred_10 ))))


(:action op_5
:parameters (?v7 ?v13 ?v8)
:precondition (and (pred_8 ?v7) (pred_3 ?v13) (pred_3 ?v8)
                  (pred_1 ?v7) (pred_11 ?v8) (pred_5 ?v13 ?v7))
:effect (and (pred_11 ?v13) (pred_5 ?v8 ?v7)
        (not (pred_11 ?v8)) (not (pred_5 ?v13 ?v7))))

(:action op_4
:parameters (?v7 ?v1)
:precondition (and (pred_8 ?v7) (pred_3 ?v1) 
                  (pred_1 ?v7) (pred_11 ?v1))
:effect (and (pred_10 ) (pred_5 ?v1 ?v7) (not (pred_11 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_07 obj_15 obj_06 obj_12 obj_20 obj_22 obj_13 obj_03 obj_21 obj_04 obj_14 obj_01 obj_16 obj_18 obj_05
    obj_09 obj_08 obj_11
    obj_10 obj_02 obj_19
    )

    (:init
       (pred_10)

       (pred_8 obj_17)
       (pred_8 obj_07)
       (pred_8 obj_15)
       (pred_8 obj_06)
       (pred_8 obj_12)
       (pred_8 obj_20)
       (pred_8 obj_22)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_8 obj_21)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_01)
       (pred_8 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_19)

       (pred_2 obj_17 obj_12)
       (pred_2 obj_17 obj_07)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_17)
       (pred_2 obj_15 obj_22)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_22)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_22 obj_04)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_22 obj_15)
       (pred_2 obj_22 obj_20)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_13 obj_22)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_21 obj_16)
       (pred_2 obj_21 obj_04)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_22)
       (pred_2 obj_04 obj_21)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_16 obj_21)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_05 obj_18)
       (pred_12 obj_22)
       (pred_12 obj_21)
       (pred_12 obj_14)
       (pred_9  obj_22 obj_09)
       (pred_9  obj_21 obj_08)
       (pred_9  obj_14 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_15)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_20)
       (pred_6 obj_13)
       (pred_6 obj_03)
       (pred_6 obj_04)
       (pred_6 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_05)

       (pred_4  obj_10 obj_09)
       (pred_4  obj_02 obj_08)
       (pred_4  obj_19 obj_11)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_19 obj_17)
       (pred_1 obj_16)
    )

    (:goal (and
       (pred_5 obj_02 obj_04)
       (pred_5 obj_19 obj_04)
    ))
(:constraints
  (always (not (pred_1 obj_20)))
)
)

; plan
1. (op_2 obj_16 obj_01)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_01)
   goals met: 0 of 2
2. (op_2 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_2 obj_03 obj_12)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_12)
   goals met: 0 of 2
4. (op_1 obj_12 obj_02)
   deleted: (pred_5 obj_02 obj_12) (pred_10)
   added: (pred_11 obj_02)
   goals met: 0 of 2
5. (op_2 obj_12 obj_03)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_03)
   goals met: 0 of 2
6. (op_3 obj_03 obj_21 obj_02 obj_08)
   deleted: (pred_12 obj_21)
   added: (pred_6 obj_21)
   goals met: 0 of 2
7. (op_2 obj_03 obj_21)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_21)
   goals met: 0 of 2
8. (op_2 obj_21 obj_04)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_04)
   goals met: 0 of 2
9. (op_4 obj_04 obj_02)
   deleted: (pred_11 obj_02)
   added: (pred_10) (pred_5 obj_02 obj_04)
   goals met: 1 of 2
10. (op_2 obj_04 obj_21)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_21)
   goals met: 1 of 2
11. (op_2 obj_21 obj_03)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_03)
   goals met: 1 of 2
12. (op_2 obj_03 obj_12)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_12)
   goals met: 1 of 2
13. (op_2 obj_12 obj_17)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_17)
   goals met: 1 of 2
14. (op_1 obj_17 obj_19)
   deleted: (pred_5 obj_19 obj_17) (pred_10)
   added: (pred_11 obj_19)
   goals met: 1 of 2
15. (op_2 obj_17 obj_12)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_12)
   goals met: 1 of 2
16. (op_2 obj_12 obj_03)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_03)
   goals met: 1 of 2
17. (op_2 obj_03 obj_21)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_21)
   goals met: 1 of 2
18. (op_2 obj_21 obj_04)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_04)
   goals met: 1 of 2
19. (op_4 obj_04 obj_19)
   deleted: (pred_11 obj_19)
   added: (pred_10) (pred_5 obj_19 obj_04)
   goals met: 2 of 2
